tutorials/multiphase/interOSFoam/BubbleChannelCa10-5/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

4
(
    inlet
    {
        type            patch;
        nFaces          100;
        startFace       119300;
    }
    outlet
    {
        type            patch;
        nFaces          100;
        startFace       119400;
    }
    wall
    {
        type            wall;
        nFaces          1200;
        startFace       119500;
    }
    frontAndBack
    {
        type            empty;
        nFaces          120000;
        startFace       120700;
    }
)


// ************************************************************************* //
